INSERT INTO hotelbooking.tblbookings (bHotelID, bGuestID,bReservationAgentID,bDateFrom,bDateTo,bRoomCount,bBookingStatusID) VALUES
(1,1,NULL,'2023-12-01 15:00:00','2023-12-02 10:00:00',1,1);

INSERT INTO hotelbooking.tblbookingstatus (bsStatus,bsDescription,bsSortOrder,bsActive) VALUES
('업체예약','업체에이전트 이용',1,1),
('개별예약','개인 예약',1,1),
('고정예약','회사 장기/단기 출장고정',1,1),
('입실예약','당일입실',1,1),
('배실확정','배실처리완료',1,1),
('취소처리','처리중지',1,1);


INSERT INTO hotelbooking.tblrates (rRoomID,rRate,rFromDate,rToDate,rRateTypeID) VALUES
 (1,155900,'2023-01-01 00:00:00','2023-12-31 00:00:00',1),
 (2,155900,'2023-01-01 00:00:00','2023-12-31 00:00:00',1),
 (3,155900,'2023-01-01 00:00:00','2023-12-31 00:00:00',1),
 (4,155900,'2023-01-01 00:00:00','2023-12-31 00:00:00',1),
 (5,155900,'2023-01-01 00:00:00','2023-12-31 00:00:00',1),
 (6,155900,'2023-01-01 00:00:00','2023-12-31 00:00:00',1),
 (7,155900,'2023-01-01 00:00:00','2023-12-31 00:00:00',1),
 (8,155900,'2023-01-01 00:00:00','2023-12-31 00:00:00',1),
 (9,155900,'2023-01-01 00:00:00','2023-12-31 00:00:00',1),
 (10,155900,'2023-01-01 00:00:00','2023-12-31 00:00:00',1),
 (11,155900,'2023-01-01 00:00:00','2023-12-31 00:00:00',1),
 (12,155900,'2023-01-01 00:00:00','2023-12-31 00:00:00',1),
 (13,109900,'2023-01-01 00:00:00','2023-12-31 00:00:00',1);
 (14,109900,'2023-01-01 00:00:00','2023-12-31 00:00:00',1),
 (15,109900,'2023-01-01 00:00:00','2023-12-31 00:00:00',1),
 (16,109900,'2023-01-01 00:00:00','2023-12-31 00:00:00',1),
 (17,109900,'2023-01-01 00:00:00','2023-12-31 00:00:00',1),
 (18,109900,'2023-01-01 00:00:00','2023-12-31 00:00:00',1),
 (19,109900,'2023-01-01 00:00:00','2023-12-31 00:00:00',1),
 (20,109900,'2023-01-01 00:00:00','2023-12-31 00:00:00',1),
 (21,132700,'2023-01-01 00:00:00','2023-12-31 00:00:00',1),
 (22,132700,'2023-01-01 00:00:00','2023-12-31 00:00:00',1),
 (23,132700,'2023-01-01 00:00:00','2023-12-31 00:00:00',1),
 (24,132700,'2023-01-01 00:00:00','2023-12-31 00:00:00',1),
 (25,132700,'2023-01-01 00:00:00','2023-12-31 00:00:00',1),
 (26,132700,'2023-01-01 00:00:00','2023-12-31 00:00:00',1),
 (27,163400,'2023-01-01 00:00:00','2023-12-31 00:00:00',1),
 (28,163400,'2023-01-01 00:00:00','2023-12-31 00:00:00',1),
 (29,163400,'2023-01-01 00:00:00','2023-12-31 00:00:00',1),
 (30,325200,'2023-01-01 00:00:00','2023-12-31 00:00:00',1),
 (31,325200,'2023-01-01 00:00:00','2023-12-31 00:00:00',1),
 (32,325200,'2023-01-01 00:00:00','2023-12-31 00:00:00',1),
 (33,325200,'2023-01-01 00:00:00','2023-12-31 00:00:00',1),
 (34,325200,'2023-01-01 00:00:00','2023-12-31 00:00:00',1),
 (35,325200,'2023-01-01 00:00:00','2023-12-31 00:00:00',1),
 (36,560100,'2023-01-01 00:00:00','2023-12-31 00:00:00',1),
 (37,560100,'2023-01-01 00:00:00','2023-12-31 00:00:00',1),
 (38,560100,'2023-01-01 00:00:00','2023-12-31 00:00:00',1),
 (39,560100,'2023-01-01 00:00:00','2023-12-31 00:00:00',1),
 (40,799600,'2023-01-01 00:00:00','2023-12-31 00:00:00',1),
 (41,799600,'2023-01-01 00:00:00','2023-12-31 00:00:00',1),
 (42,198700,'2023-01-01 00:00:00','2023-12-31 00:00:00',1),
 (43,198700,'2023-01-01 00:00:00','2023-12-31 00:00:00',1),
 (44,198700,'2023-01-01 00:00:00','2023-12-31 00:00:00',1),
 (45,198700,'2023-01-01 00:00:00','2023-12-31 00:00:00',1),
 (46,198700,'2023-01-01 00:00:00','2023-12-31 00:00:00',1),
 (47,198700,'2023-01-01 00:00:00','2023-12-31 00:00:00',1);

INSERT INTO hotelbooking.tblratetypes (rtRateType,rtDescription,rtSortOrder,rtActive) VALUES
 ('없음','없음',1,1),
 ('시니어','시니어우대',1,1),
 ('프로모션코드','행사처리',1,1),
 ('회사코드','회사출장고정계약',1,1),
 ('그룹코드','특수그룹코드',1,1),
 ('요금코드','이벤트',1,1);

INSERT INTO hotelbooking.tblrooms (rHotelID,rFloor,rRoomTypeID,rRoomNumber,rDesription,rRoomStatusID) VALUES
	 (1,3,6,'무궁화1','바다전경이 보이는 위치',1),
	 (1,3,6,'무궁화2','바다전경이 안보이는 위치',1),
	 (1,3,6,'무궁화3','바다전경이 보이는 위치',1),
	 (1,3,6,'무궁화4','바다전경이 안보이는 위치',1),
	 (1,3,6,'무궁화5','바다전경이 보이는 위치',1),
	 (1,3,6,'무궁화6','바다전경이 안보이는 위치',1),
	 (1,3,6,'무궁화7','바다전경이 보이는 위치',1),
	 (1,3,6,'무궁화8','바다전경이 안보이는 위치',1),
	 (1,3,6,'무궁화9','바다전경이 보이는 위치',1),
	 (1,3,6,'무궁화10','바다전경이 안보이는 위치',1);
INSERT INTO hotelbooking.tblrooms (rHotelID,rFloor,rRoomTypeID,rRoomNumber,rDesription,rRoomStatusID) VALUES
	 (1,3,6,'무궁화11','바다전경이 보이는 위치',1),
	 (1,3,6,'무궁화12','바다전경이 안보이는 위치',1),
	 (1,5,8,'개나리1','바다전경이 안보이는 위치',1),
	 (1,5,8,'개나리2','바다전경이 안보이는 위치',1),
	 (1,5,8,'개나리3','바다전경이 안보이는 위치',1),
	 (1,5,8,'개나리4','바다전경이 안보이는 위치',1),
	 (1,5,8,'개나리5','바다전경이 안보이는 위치',1),
	 (1,5,8,'개나리6','바다전경이 안보이는 위치',1),
	 (1,5,8,'개나리7','바다전경이 안보이는 위치',1),
	 (1,5,8,'개나리8','바다전경이 안보이는 위치',1);
INSERT INTO hotelbooking.tblrooms (rHotelID,rFloor,rRoomTypeID,rRoomNumber,rDesription,rRoomStatusID) VALUES
	 (1,5,7,'살구1','바다전경이 안보이는 위치',1),
	 (1,5,7,'살구2','바다전경이 안보이는 위치',1),
	 (1,5,7,'살구3','바다전경이 안보이는 위치',1),
	 (1,5,7,'살구4','바다전경이 보이는 위치',1),
	 (1,5,7,'살구5','바다전경이 보이는 위치',1),
	 (1,5,7,'살구6','바다전경이 보이는 위치',1),
	 (1,4,5,'목련1','바다전경이 보이는 위치',1),
	 (1,4,5,'목련2','바다전경이 보이는 위치',1),
	 (1,4,5,'목련3','바다전경이 보이는 위치',1),
	 (1,6,3,'진달래1','바다전경이 안보이는 위치',1);
INSERT INTO hotelbooking.tblrooms (rHotelID,rFloor,rRoomTypeID,rRoomNumber,rDesription,rRoomStatusID) VALUES
	 (1,6,3,'진달래2','바다전경이 안보이는 위치',1),
	 (1,6,3,'진달래3','바다전경이 안보이는 위치',1),
	 (1,6,3,'진달래4','바다전경이 안보이는 위치',1),
	 (1,6,3,'진달래5','바다전경이 안보이는 위치',1),
	 (1,6,3,'진달래6','바다전경이 안보이는 위치',1),
	 (1,7,2,'철죽1','바다전경이 안보이는 위치',1),
	 (1,7,2,'철죽2','바다전경이 안보이는 위치',1),
	 (1,7,2,'철죽3','바다전경이 안보이는 위치',1),
	 (1,7,2,'철죽4','바다전경이 안보이는 위치',1),
	 (1,8,1,'앵두1','바다전경이 안보이는 위치',1);
INSERT INTO hotelbooking.tblrooms (rHotelID,rFloor,rRoomTypeID,rRoomNumber,rDesription,rRoomStatusID) VALUES
	 (1,8,1,'액두2','바다전경이 안보이는 위치',1),
	 (1,4,4,'국화1','바다전경이 안보이는 위치',1),
	 (1,4,4,'국화2','바다전경이 안보이는 위치',1),
	 (1,4,4,'국화3','바다전경이 안보이는 위치',1),
	 (1,4,4,'국화4','바다전경이 안보이는 위치',1),
	 (1,4,4,'국화5','바다전경이 안보이는 위치',1),
	 (1,4,4,'국화6','바다전경이 안보이는 위치',1);

INSERT INTO hotelbooking.tblroomsbooked (rbRoomID,rbRoomType,rbRate) VALUES
(27,5,163400);


INSERT INTO hotelbooking.tblroomstatus (rsRoomStatus,rsDescription,rsSortOrder,reActive) VALUES
 ('대기','숙박가능',1,1),
 ('예약','예약상태(배실처리)',1,1),
 ('입실','입실상태',1,1),
 ('퇴실','퇴실상태',1,1),
 ('정비','정비작업중',1,1),
 ('수리','수리작업중',1,1),
 ('안식','대실중지',1,0);

INSERT INTO hotelbooking.tblroomtypes (rtRoomType,rtDescription,rtSortOrder,rtActive) VALUES
 ('Suite Family','장기투숙을 위한 최상 거주시설',1,1),
 ('Suite','고급스런 인테리어',1,1),
 ('Delux Family','가족을 위한 침실',1,1),
 ('Delux Double','퀸침대를 구비한 침실',1,1),
 ('Delux Twin','두개의 편리한 침대',1,1),
 ('Standard Twin','두개의  침대',1,1),
 ('Standard SuperTwin','두개의 더블침대',1,1),
 ('Standard Single','저렴한 숙소',1,1);
